# ProjectRevisionRevisionDate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProjectRevisionRevisionDate Property
ParameterTypeId Class See Also
---
"Revision Date"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProjectRevisionRevisionDate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectRevisionRevisionDate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProjectRevisionRevisionDate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace